{"type":"data","nodes":[null,null,null,{"type":"data","data":[{"title":1,"image":2,"content":6,"next":7},"CKOITGROL",[3,4,5],"/images/troisannee/CKOITGROL1.jpg","/images/troisannee/CKOITGROL2.jpg","/images/troisannee/CKOITGROL3.jpg","Le projet CKOITGROL émane de la pensée de 4 collaborateurs, collègues et amis qui ont pour seule demande : réaliser une solution mobile de reconnaissance d'images par IA avec un modèle entraîné à la main. \n L'objectif de ce projet, comprendre et s'initier au monde de l'intelligence artificielle grâce à un sujet libre de notre choix et en totale autonomie quant au choix des technologies et solutions mises en place. \n Mon groupe, constitué avec 3 de mes amis, s'était fixé comme objectif de créer une plateforme style réseau social, avec pour but de partager avec des amis, quel style de chaussures nous avions au pied et ce grâce à une reconnaissance par IA. \n\n Notre choix pour les technologies fut le suivant :\n Mobile : Flutter, un outil que nous avons déjà prit en main à plusieurs occasions et dont un membre du groupe est très familier.\n Database: Firebase, un outil nouveau, jamais manipulé par notre part auparavant qui permet d'instauré de l'authentification et des données dynamiques en temps réel dans notre APK.\n Modèle IA : Yolov5, c'était le modèle avec lequel nous avions le plus de facilité et celui qui était le plus performant pour répondre à notre sujet. Bien que des essais ai été effectués avec Yolov11 et Yolov7, ceux-ci ne répondait pas à nos attentes et prenait trop de temps machine.\n\n Le résultat final était celui escompté, nous étions en capacité de reconnaître à 90% de précision quel type de chaussures l'utilisateur portait, que cela soit en temps réel, en photo ou à partir de la galerie. Si toutefois nous en étions incapable, l'utilisateur mentionnait une erreur du modèle et via notre backend nous entraînions le modèle avec les nouvelles données fournies, images et labels.","ckoitgrol"],"uses":{"params":["name"]}}]}
